package com.handsome.democode.java_basic.basic;

public class StringLength {

    public static void main(String[] args) {
        String s = "中国是个美丽的国家中国是个美丽的国家中国是个美丽的国家中国是个美丽的国家中国" +
                "是个美丽的国家中国是个美丽的国家中国是个美丽的国家中国是个美丽的国家中国是个美丽的" +
                "国家中国是个美丽的国家中国是个美丽的国家中国是个美丽的国家中国是个美丽的国家中国是个" +
                "美丽的国家中国是个美丽的国家中国是个美丽的国家中国是个美丽的国家中国是个美丽的国家中" +
                "国是个美丽的国家中国是个美丽的国家中国是个美丽的国家中国是个美丽的国家中国是个美丽的" +
                "国家中国是个美丽的国家中国是个美丽的国家中国是个美丽的国家中国是个美丽的国家中国是个" +
                "美丽的国家中国是个美丽的国家中国是个美丽的国家中国是个美丽的国家中国是个美丽的国家中国" +
                "是个美丽的国家中国是个美丽的国家中国是个美丽的国家中国是个美丽的国家";
        System.out.println(s.length());
        System.out.println(s.getBytes().length);
    }
}
